spec/data/ccms/applicant_add_status_request.xml

<?xml version='1.0' encoding='UTF-8'?>
<soap:Envelope xmlns:xsd='http://www.w3.org/2001/XMLSchema' xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance' xmlns:clientbim='http://legalservices.gov.uk/CCMS/ClientManagement/Client/1.0/ClientBIM' xmlns:soap='http://schemas.xmlsoap.org/soap/envelope/' xmlns:secext='http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd' xmlns:hdr='http://legalservices.gov.uk/Enterprise/Common/1.0/Header' xmlns:common='http://legalservices.gov.uk/Enterprise/Common/1.0/Common' xmlns:clientbio='http://legalservices.gov.uk/CCMS/ClientManagement/Client/1.0/ClientBIO'>
  <soap:Header>
    <secext:Security>
      <secext:UsernameToken>
        <secext:Username>my_soap_client_username</secext:Username>
        <secext:Password Type='password_type'>xxxxx</secext:Password>
      </secext:UsernameToken>
    </secext:Security>
  </soap:Header>
  <soap:Body>
    <clientbim:ClientAddUpdtStatusRQ>
      <hdr:HeaderRQ>
        <hdr:TransactionRequestID>20190101121530123456</hdr:TransactionRequestID>
        <hdr:Language>ENG</hdr:Language>
        <hdr:UserLoginID>my_login</hdr:UserLoginID>
        <hdr:UserRole>my_role</hdr:UserRole>
      </hdr:HeaderRQ>
      <clientbim:TransactionID>20190101121530123456</clientbim:TransactionID>
    </clientbim:ClientAddUpdtStatusRQ>
  </soap:Body>
</soap:Envelope>
