spec/data/ccms/applicant_search_request.xml

<?xml version='1.0' encoding='UTF-8'?>
<soap:Envelope xmlns:xsd='http://www.w3.org/2001/XMLSchema' xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance' xmlns:ns2='http://legalservices.gov.uk/CCMS/ClientManagement/Client/1.0/ClientBIM' xmlns:soap='http://schemas.xmlsoap.org/soap/envelope/' xmlns:ns1='http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd' xmlns:ns3='http://legalservices.gov.uk/Enterprise/Common/1.0/Header' xmlns:ns4='http://legalservices.gov.uk/Enterprise/Common/1.0/Common' xmlns:ns5='http://legalservices.gov.uk/CCMS/ClientManagement/Client/1.0/ClientBIO'>
  <soap:Header>
    <ns1:Security>
      <ns1:UsernameToken>
        <ns1:Username>my_soap_client_username</ns1:Username>
        <ns1:Password Type='password_type'>xxxxx</ns1:Password>
      </ns1:UsernameToken>
    </ns1:Security>
  </soap:Header>
  <soap:Body>
    <ns2:ClientInqRQ>
      <ns3:HeaderRQ>
        <ns3:TransactionRequestID>20190101121530123456</ns3:TransactionRequestID>
        <ns3:Language>ENG</ns3:Language>
        <ns3:UserLoginID>my_login</ns3:UserLoginID>
        <ns3:UserRole>my_role</ns3:UserRole>
      </ns3:HeaderRQ>
      <ns2:RecordCount>
        <ns4:MaxRecordsToFetch>200</ns4:MaxRecordsToFetch>
        <ns4:RetriveDataOnMaxCount>false</ns4:RetriveDataOnMaxCount>
      </ns2:RecordCount>
      <ns2:SearchCriteria>
        <ns2:ClientInfo>
          <ns5:FirstName>lenovo</ns5:FirstName>
          <ns5:Surname>hurlock</ns5:Surname>
          <ns5:DateOfBirth>1969-01-01</ns5:DateOfBirth>
          <ns5:NINumber>YS327299B</ns5:NINumber>
        </ns2:ClientInfo>
      </ns2:SearchCriteria>
    </ns2:ClientInqRQ>
  </soap:Body>
</soap:Envelope>
